// 日记配置文件
window.diaryConfig = {
    diaries: [
        { content: "提示词   AI内容讲解，不如拿AI洗稿 \n 1. 引用了哪些官方函数，标数字序号\n 2. 文件名字＋中文翻译\n 3. 函数原型，函数中文说明，参数解析", date: "2025-12-19" },
        { content: "提示词  驱动，看视频\n  1. 所在文件位置  2. 全屏翻译\n  3.1 函数参数， 3.2 函数官方or自定义， 3.3 函数原型，逐行注释\n        可以豆包打视频", date: "2025-12-18" },
        { content: "提示词   源码阅读 : 流程图＋函数名＋逐行翻", date: "2025-12-04" },
        { content: "提示词 r1打框架，mm执行逻辑，k2改bug", date: "2025-11-30" },
        { content: "阅读 : 偶然发现，把吾爱破解链接扔给AI讲，对深夜失眠有奇效。", date: "2025-11-28" },
        { content: "阅读，梯子＋狐猴＋谷歌翻译，阅读英文网站好一些", date: "2025-11-25" },
        { content: "提示词 快餐时代，节省时间，尽量记函数名，搭一眼函数逻辑", date: "2025-11-25" },
        { content: "提示词 AI，输入记不住太多东西，输出也记不住太多东西\n调试要记得清理缓存＋打印日志或弹窗", date: "2025-11-25" },
        { content: "加密 说一下思路\n  1. 把要信息传递的内容进行rsa加密\n  2. 把加密后的内容变成二维码\n  3. 修改图片后缀，jpg变成txt\n  4.可以在重复一遍上述操作\n  5.如果可以的话，可以用文件拆分合并脚本 ， 对txt进行固定格式数据清洗\n    「当然，解密方法最快还是社会工程，直接emm」", date: "2025-11-24" },
        { content: "提示词 f（AI输出）=用户输入＋数据库，而AI又记不住太多内容，所以网页函数提取＋任务会好一些。", date: "2025-11-24" },
        { content: "就有种错觉，像是做错了某种决定。从几十年后回来了，只知道很长很长", date: "2025-11-20" },
        { content: "我叫南堂，南风的南，满堂的堂\n\n元明那年，北方战乱，汴梁还闹了饥荒，\n我在赶往京城的路上，与父母走散了\n\n因为我很小，不识字，但懂一些简单的话语，只知道要去一个叫京城的地方\n\n京城灯火通明，但看着万家灯火，内心有种说不出的难受，\n\n不是因为连年战乱，也不是因为与父母的离散，只是恨自己不争气，要是自己没有出生\n该多好\n\n直到我遇见了他\n\n那年 是凉安在京城收留了我。\n\n遇见他的时候，一席白衣，风度翩翩，手里用布包裹着馒头，分给那些落难来到京城的人  \n\n公子在很远处就看到了我，我眨着眼睛，看着硕大的馒头，口水与眼泪不争气的溜了下来\n\n凉安拿着馒头，递给了我，说，姑娘吃吧。这是给你的 没有人会动你的东西\n\n我咿咿呀呀的说着谢谢，偶尔听到他在旁边说不急不急\n\n那是我这辈子吃过最好吃的东西\n\n后来，他收留了我。", date: "2020-01-01" }
    ]
};
